/************************************************************************
 * @file 02_bus.c
 * @brief 项目程序入口
 * @author tiwater
 * @date 2022-10-24 17:36:37
 * @copyright tiwater
 ************************************************************************/

/************************************************************************
 * 设置ticos_onloop函数触发间隔，若不配置，则默认为200毫秒
 ************************************************************************/
#define TICOS_HEARTBEAT_MILLIS 1000

#include "ticos_project.h"
#include <ticos/log.h>

/************************************************************************
 * 生命周期函数，负责系统启动后的自定义初始化工作
 ************************************************************************/
int ticos_onboot(void) {
    return TICOS_OK;
}

/************************************************************************
 * 生命周期函数，按照一定时间间隔(TICOS_HEARTBEAT_MILLIS)触发
 ************************************************************************/
int ticos_onloop(void) {
    // 输出从GSENSOR设备缓存中得到的三轴数据
    silan_sc7a20_t* gs = ticos_dev(GSENSOR);
    float x = ticos_get(gs, x);
    float y = ticos_get(gs, y);
    float z = ticos_get(gs, z);
    ticos_logd("%s x = %f, y = %f, z = %f", ticos_dev_name(GSENSOR), x, y, z);
    return TICOS_OK;
}
