/************************************************************************
 * @file 01_device.c
 * @brief 项目程序入口
 * @author tiwater
 * @date 2022-10-24 17:36:37
 * @copyright tiwater
 ************************************************************************/

/************************************************************************
 * 设置ticos_onloop函数触发间隔，若不设置，则默认为200毫秒
 ************************************************************************/
#define TICOS_HEARTBEAT_MILLIS 250

#include "ticos_project.h"
#include <ticos/log.h>

/************************************************************************
 * 生命周期函数，负责系统启动后的自定义初始化工作
 ************************************************************************/
int ticos_onboot(void) {
    return TICOS_OK;
}

/************************************************************************
 * 生命周期函数，按照一定时间间隔(TICOS_HEARTBEAT_MILLIS)触发
 ************************************************************************/
int ticos_onloop(void) {
    // 检查IO1设备缓存中的level值是否已被更新
    ticos_gpio_t* io_1 = ticos_dev(IO1);
    if (ticos_isdirty(io_1, level)) {
        bool level = ticos_get(io_1, level);
        // 当IO1电平变化时将DEV_IO3设置为反相
        ticos_dev_setval(IO3, level, !level);
    }
    return TICOS_OK;
}
